Revit 2024 API
ReinforcementSettings.GetReinforcementAbbreviationTags Method
 Gets a list of abbreviation tags for desired reinforcement object type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public IList<ReinforcementAbbreviationTag> GetReinforcementAbbreviationTags(
	ReinforcementAbbreviationObjectType objectType
)
Visual Basic
Public Function GetReinforcementAbbreviationTags ( _
	objectType As ReinforcementAbbreviationObjectType _
) As IList(Of ReinforcementAbbreviationTag)
Visual C++
public:
IList<ReinforcementAbbreviationTag^>^ GetReinforcementAbbreviationTags(
	ReinforcementAbbreviationObjectType objectType
)
Parameters
objectType
Type: Autodesk.Revit.DB.Structure.ReinforcementAbbreviationObjectType
 Defines the type of desired reinforcement object for abbreviation tags.
Return Value
 An array of ReinforcementAbbreviationTag that will define all abbreviations for given reinforcement object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace